In [4]:
import pandas as pd
data =pd.read_csv(r"C:\Users\Aiman\Downloads\test2.csv")
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [2]:
data.isnull()

   Unnamed: 0   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False   True       False   False
4       False  False  False       False    True
5       False  False  False       False   False

In [4]:
data.loc["0":"1","Name":"Department"]

    Name   Age Department
0  Alice  25.0         HR
1    Bob  30.0         IT

In [5]:
data.loc[1:3,"Name":"Department"]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [7]:
data.iloc[1:4,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [9]:
data.rename(columns={"Name":"N","Age":"A","Department":"D","Salary":"S"})

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [10]:
data.rename(columns={"Name":"N","Age":"A","Department":"D","Salary":"S"},inplace=True)

In [11]:
data

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [13]:
data.drop('Unnamed: 0',axis=1,inplace=True)

In [14]:
data

         N     A        D        S
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

In [22]:
data["updated_Salary"]=data["S"]+5000

In [23]:
data

         N     A        D        S  updated_Salary
0    Alice  25.0       HR  50000.0         55000.0
1      Bob  30.0       IT  60000.0         65000.0
2  Charlie  35.0  Finance  70000.0         75000.0
3    David   NaN       IT  62000.0         67000.0
4      Eve  29.0       HR      NaN             NaN
5    Alice  25.0       HR  50000.0         55000.0

In [24]:
data["updated_Salary2"]=data["S"].map(lambda x:x+10000)

In [25]:
data

         N     A        D        S  updated_Salary  updated_Salary2
0    Alice  25.0       HR  50000.0         55000.0          60000.0
1      Bob  30.0       IT  60000.0         65000.0          70000.0
2  Charlie  35.0  Finance  70000.0         75000.0          80000.0
3    David   NaN       IT  62000.0         67000.0          72000.0
4      Eve  29.0       HR      NaN             NaN              NaN
5    Alice  25.0       HR  50000.0         55000.0          60000.0

In [26]:
data.dropna(inplace=True)

In [27]:
data

         N     A        D        S  updated_Salary  updated_Salary2
0    Alice  25.0       HR  50000.0         55000.0          60000.0
1      Bob  30.0       IT  60000.0         65000.0          70000.0
2  Charlie  35.0  Finance  70000.0         75000.0          80000.0
5    Alice  25.0       HR  50000.0         55000.0          60000.0

In [28]:
data.head()

         N     A        D        S  updated_Salary  updated_Salary2
0    Alice  25.0       HR  50000.0         55000.0          60000.0
1      Bob  30.0       IT  60000.0         65000.0          70000.0
2  Charlie  35.0  Finance  70000.0         75000.0          80000.0
5    Alice  25.0       HR  50000.0         55000.0          60000.0

In [29]:
data.isnull().sum()

N                  0
A                  0
D                  0
S                  0
updated_Salary     0
updated_Salary2    0
dtype: int64

In [30]:
data =pd.read_csv(r"C:\Users\Aiman\Downloads\test2.csv")
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [31]:
data.dropna(inplace=True)

In [32]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
5           5    Alice  25.0         HR  50000.0

In [33]:
data.head()

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
5           5    Alice  25.0         HR  50000.0

In [34]:
data.isnull().sum()

Unnamed: 0    0
Name          0
Age           0
Department    0
Salary        0
dtype: int64

In [10]:
data.drop('Unnamed: 0',axis=1,inplace=True)

In [11]:
data

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David  28.8         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [37]:
data["Age"]=data.Age.astype("int")

In [9]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [40]:
data["updated_Salary"]=data["Salary"]+5000

In [41]:
data

      Name  Age Department   Salary  updated_Salary
0    Alice   25         HR  50000.0         55000.0
1      Bob   30         IT  60000.0         65000.0
2  Charlie   35    Finance  70000.0         75000.0
5    Alice   25         HR  50000.0         55000.0

In [42]:
data["updated_Salary2"]=data["Salary"].map(lambda x:x+10000)

In [43]:
data

      Name  Age Department   Salary  updated_Salary  updated_Salary2
0    Alice   25         HR  50000.0         55000.0          60000.0
1      Bob   30         IT  60000.0         65000.0          70000.0
2  Charlie   35    Finance  70000.0         75000.0          80000.0
5    Alice   25         HR  50000.0         55000.0          60000.0

In [44]:
data[data["Age"]>25]

      Name  Age Department   Salary  updated_Salary  updated_Salary2
1      Bob   30         IT  60000.0         65000.0          70000.0
2  Charlie   35    Finance  70000.0         75000.0          80000.0

In [12]:
data["Age"] = data["Age"].fillna(value=data["Age"].mean())

In [13]:
data

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David  28.8         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [14]:
data["Salary"] = data["Salary"].fillna(value=data["Salary"].mean())

In [15]:
data

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David  28.8         IT  62000.0
4      Eve  29.0         HR  58400.0
5    Alice  25.0         HR  50000.0

In [16]:
data["Department"].value_counts()

Department
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [17]:
data["Age"] = data["Age"].fillna(method="ffill")
data["Salary"] = data["Salary"].fillna(method="bfill")

C:\Users\Aiman\AppData\Local\Temp\ipykernel_8916\700211552.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data["Age"] = data["Age"].fillna(method="ffill")
C:\Users\Aiman\AppData\Local\Temp\ipykernel_8916\700211552.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data["Salary"] = data["Salary"].fillna(method="bfill")

In [18]:
data

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David  28.8         IT  62000.0
4      Eve  29.0         HR  58400.0
5    Alice  25.0         HR  50000.0

In [19]:
data.Age.ffill()

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [20]:
data["updated_salary"] = data["Salary"].apply(lambda x:x+500)

In [21]:
data

      Name   Age Department   Salary  updated_salary
0    Alice  25.0         HR  50000.0         50500.0
1      Bob  30.0         IT  60000.0         60500.0
2  Charlie  35.0    Finance  70000.0         70500.0
3    David  28.8         IT  62000.0         62500.0
4      Eve  29.0         HR  58400.0         58900.0
5    Alice  25.0         HR  50000.0         50500.0

In [28]:
data["level"]=data.apply(lambda h:"High" if h["Salary"]>60000 else "Low",axis=1)

In [29]:
data

      Name   Age Department   Salary  updated_salary level
0    Alice  25.0         HR  50000.0         50500.0   Low
1      Bob  30.0         IT  60000.0         60500.0   Low
2  Charlie  35.0    Finance  70000.0         70500.0  High
3    David  28.8         IT  62000.0         62500.0  High
4      Eve  29.0         HR  58400.0         58900.0   Low
5    Alice  25.0         HR  50000.0         50500.0   Low

In [30]:
data["level"]=data.apply(lambda h:"High" if h["updated_salary"]>60000 else "Low",axis=1)

In [31]:
data

      Name   Age Department   Salary  updated_salary level
0    Alice  25.0         HR  50000.0         50500.0   Low
1      Bob  30.0         IT  60000.0         60500.0  High
2  Charlie  35.0    Finance  70000.0         70500.0  High
3    David  28.8         IT  62000.0         62500.0  High
4      Eve  29.0         HR  58400.0         58900.0   Low
5    Alice  25.0         HR  50000.0         50500.0   Low

In [32]:
data.groupby("Department")["Salary"].mean()

Department
Finance    70000.0
HR         52800.0
IT         61000.0
Name: Salary, dtype: float64

In [33]:
filtered = data[(data["Age"] >28)&(data["Salary"] >50000)]

In [34]:
filtered

      Name   Age Department   Salary  updated_salary level
1      Bob  30.0         IT  60000.0         60500.0  High
2  Charlie  35.0    Finance  70000.0         70500.0  High
3    David  28.8         IT  62000.0         62500.0  High
4      Eve  29.0         HR  58400.0         58900.0   Low

In [36]:
filtered = data[(data["Age"] >28)&(data["Department"] =="IT")]

In [37]:
filtered

    Name   Age Department   Salary  updated_salary level
1    Bob  30.0         IT  60000.0         60500.0  High
3  David  28.8         IT  62000.0         62500.0  High